<!DOCTYPE html>
<html lang="es">

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>Ejercicio 1</title>
	<style>
		body {
			margin: 0;
		}

		/* h  e  a  d  e  r*/
		header {
			width: 100vw;
			font-family: monospace;
		}

		/* bloque superior*/
		#bloqueSuperior {
			height: 50%;
			background-color: #691193;

		}

		#listaMenu {
			list-style-type: none;
			color: white;
			padding: 22px;

		}

		.menuBloqueSuperior {
			width: 19%;
			display: inline-block;
		}

		#iebs {
			font-weight: 900;

		}

		#oferta {
			background-color: #691193;
			/* margin-left: 70vw; */
			border: 2px solid white;
			border-radius: 60px;
			font-family: "Open Sans", sans-serif;
			text-align: center;
			font-size: small;
		}

		#pruebanos {
			background-color: #691193;
			/* margin: 5px; */
			border: 2px solid white;
			border-radius: 60px;
			font-family: "Open Sans", sans-serif;
			text-align: center;
			font-size: small;
		}

		/* navegador superior*/
		#naveSuperior {
			height: 45%;
		}

		#naveMenu {
			list-style-type: none;
			color: black;
			font-weight: 900;
			font-size: large;
			margin-left: 165px;
		}

		.listaNav {
			width: 15%;
			display: inline-block;
		}

		/* M      A     I       N*/
		main {
			width: 100vw;

		}

		#analitica {
			background-color: #691193;
			width: 100vw;
			height: 50vh;
			text-align: center;
			color: white;
			background-image: url("/bg-general-blog.webp");

		}

		a {
			text-decoration: none;
			color: azure;
		}

		#tituloPrincipal {
			padding-top: 20vh;
		}

		.parrafo {
			width: 40vw;
			margin-left: 300px;
			font-family: 'Montserrat', Helvetica, Arial, sans-serif;
			color: #263238;
			font-size: 20px;

		}

		.parrafo1 {
			width: 40vw;
			margin-left: 120px;
			font-family: 'Montserrat', Helvetica, Arial, sans-serif;
			color: #691193;
			font-size: 20px;
		}

		#imagen1 {
			width: 40vw;
			margin-left: 300px;
		}

		#imagen2 {
			width: 40vw;
			margin-left: 300px;
		}

		#imagen3 {
			width: 40vw;
			margin-left: 0px;
		}

		h2 {
			margin-left: 300px;
		}

		/* F     O    O    T    E    R*/
		#MenuPie {
			width: 100vw;
			height: 40vh;
			background-color: black;
		}

		#Menu1Pie {
			list-style-type: none;
		}

		.listaMenu1Pie {
			color: white;
			font-size: 14px;
		}

		.listaDesglosadaPie {
			display: inline-block;
			font-size: x-small;
		}

		h5 {
			color: white;
		}

		#titulo1 {
			font-size: larger;
		}

		ul {
			margin: 50px;
		}
	</style>
</head>

<body>
	<header>
		<div id="bloqueSuperior">
			<ul id="listaMenu">
				<li id="iebs" class="menuBloqueSuperior">
					<p>=</p>
				</li>
				<li id="iebs" class="menuBloqueSuperior">
					<p>IEBS</p>
				</li>
				<li class="menuBloqueSuperior">
					&nbsp;
				</li>
				<li id="oferta" class="menuBloqueSuperior">
					<p>OFERTA ACADÉMICA</p>
				</li>
				<li id="pruebanos" class="menuBloqueSuperior">
					<p>PRUEBA GRATIS</p>
				</li>
			</ul>
		</div>
		<nav id="naveSuperior">
			<ul id="naveMenu">
				<li id="amarillo" class="listaNav">
					<p>BLOG</p>
				</li>
				<li id="azul" class="listaNav">
					<p>CATEGORÍAS &gt;</p>
				</li>
				<li id="rojo" class="listaNav">
					<p>MEDIA &gt;</p>
				</li>
				<li id="verde" class="listaNav">
					<p>OPEN LEARNING &gt;</p>
				</li>
				<li id="naranja" class="listaNav">
					<p>SOMOS IEBS &gt;</p>
				</li>
				<li id="morado" class="listaNav">
					<p>APRENDE EN IEBS &gt;</p>
				</li>
			</ul>
		</nav>
	</header>
	<main>
		<section>
			<div id="analitica">
				<h1 id="tituloPrincipal"><a href="">ANALITICA Y USABILIDAD</a></h1>
			</div>
		</section>
		<p class="parrafo">

			<b>IEBS &gt; Marketing &gt; Analítica y Usabilidad &gt; Blog &gt;</b> ¿Qué es una etiqueta HTML y cuáles son
			las más importantes?<br><br>

			Iniciarse en el mundo de la programaci&oacute;n web es una decisi&oacute;n que cada vez m&aacute;s personas
			toman, conscientes de las oportunidades profesionales que supone contar con este tipo de conocimientos tan
			valorados por las empresas de hoy en d&iacute;a. Comprender el significado y la composici&oacute;n de las
			<b>etiquetas HTML</b> es uno de los primeros pasos que cualquier profesional que aspire a convertirse en
			desarrollador o ingeniero web debe dar.<br><br>

			Con el objetivo de que entiendas <b>qu&eacute; es una etiqueta HTML</b>, uno de los conceptos b&aacute;sicos
			con los que trabajar&aacute;s en programas tan solicitados como nuestro<b class="parrafo1"> Excutive Master
				en Marketing Digital, Anal&iacute;tica y UX,</b>
			queremos ense&ntilde;arte c&oacute;mo funciona la capa m&aacute;s b&aacute;sica de una web y que puedas
			lanzarte a dise&ntilde;ar las tuyas sin miedo. &iquest;Nos acompa&ntilde;as en esta gu&iacute;a
			introductoria?
		</p>

		<img id="imagen1" src="/imagen1.png" alt=""><br><br>


		<img id="imagen2" src="/imagen2.png" alt="">

		<h2>&iquest;Qu&eacute; es una etiqueta HTML?</h2>
		<p class="parrafo">
			HTML es un markup language, lo que significa que est&aacute; escrito con c&oacute;digos que puede leer una
			persona sin que sea necesario compilarlo primero. En otras palabras, el texto en una p&aacute;gina web
			est&aacute; &laquo;marcado&raquo; con estos c&oacute;digos para dar instrucciones al navegador web sobre
			c&oacute;mo mostrar el texto. Estas <b> etiquetas de marcado</b> son las propias etiquetas HTML.<br><br>

			Cuando escribes c&oacute;digo en HTML, est&aacute;s escribiendo etiquetas HTML. Todas las etiquetas HTML
			est&aacute;n hechas con un n&uacute;mero de partes espec&iacute;ficas, incluyendo:<br><br>

			El car&aacute;cter &ldquo;menor que&rdquo; &lt;<br><br>
			Una palabra o car&aacute;cter que determina qu&eacute; etiqueta se est&aacute; escribiendo<br><br>
			Cualquier n&uacute;mero de atributos HTML que se quiera usar, escritos de la forma nombre
			=&rdquo;valor&rdquo;<br><br>
			El car&aacute;cter &ldquo;mayor que&rdquo; &gt;<br><br>

			El <b>hipertexto (HTML)</b> es un lenguaje inform&aacute;tico que forma la mayor&iacute;a de las
			p&aacute;ginas web y plataformas online. HTML no se considera un lenguaje de programaci&oacute;n, ya que no
			puede crear una funcionalidad din&aacute;mica. Sin embargo, los usuarios web pueden crear y estructurar
			secciones, p&aacute;rrafos y enlaces usando <b>elementos, etiquetas y atributos.</b>
		</p>

		<h2>&iquest;C&oacute;mo funcionan las etiquetas HTML?</h2>
		<p class="parrafo">La mayor&iacute;a de p&aacute;ginas web tienen varias p&aacute;ginas HTML diferentes. Por
			ejemplo, una p&aacute;gina de inicio, otra de producto, otra de contacto, etc. Cada una de estas tiene HTML
			separados. Los documentos HTML son archivos que acaban con .html o .htm. Un navegador lee el archivo y
			muestra su contenido para los internautas puedan verlo.<br><br>

			Como hemos comentado anteriormente, todas las p&aacute;ginas HTML contienen una serie de elementos HTML que
			a la vez disponen de diferentes etiquetas y atributos. Es decir, los elementos HTML son los componentes
			b&aacute;sicos de una p&aacute;gina web. Una etiqueta contiene mucha informaci&oacute;n. Le indica al
			navegador d&oacute;nde empieza y d&oacute;nde termina cada elemento, mientras que un atributo describe las
			caracter&iacute;sticas.<br><br>

			Los elementos HTML suelen dividirse en tres partes. Esta combinaci&oacute;n de las tres crea un elemento
			HTML.

			&nbsp; Etiqueta de apertura: Se utiliza para indicar d&oacute;nde empieza un elemento. Est&aacute; envuelta
			en corchete de apertura y cierre. Por ejemplo puedes usar la etiqueta de inicio &lt;p&gt; para crear un
			p&aacute;rrafo.<br><br>

			&nbsp; Contenido: El contenido es el resultado que ve la audiencia.<br><br>

			&nbsp; Etiqueta de cierre: Es lo mismo que la etiqueta de apertura pero con una barra inclinada delante del
			nombre del elemento. &nbsp; Es decir, &lt;&#47p&gt; para finalizar un p&aacute;rrafo.<br><br>

			Otra parte fundamental de un elemento HTML son los atributos. Estos tienen dos secciones:<br><br>

			&nbsp;<b>Nombre:</b> El nombre identifica la informaci&oacute;n adicional que un usuario quiere
			agregar.<br><br>
			&nbsp;<b>Valor del atributo:</b> Da m&aacute;s detalles que el anterior.<br><br>

			¿Cuáles son las etiquetas HTML básicas?<br><br>
			Hay una serie de etiquetas que son las más usadas para crear cualquier documento HTML, a continuación las
			explicamos:

			<b>&lt;body&gt;</b>para el contenido<br><br>
			<b>&lt;head&gt;</b>para información sobre el documento<br><br>
			<b>&lt;div&gt;</b>división dentro del contenido<br><br>
			<b>&lt;a&gt;</b>para enlaces<br><br>
			<b>&lt;strong&gt;</b>para poner el texto en negrita<br><br>
			<b>&lt;br&gt;</b>para saltos de línea<br><br>
			<b>&lt;h1&gt;...&lt;h6&gt;</b>para títulos dentro del contenido<br><br>
			<b>&lt;img&gt;</b>para añadir imágenes al documento<br><br>
			<b>&lt;ol&gt;</b>para listas ordenadas, &lt;ul&gt; para listas desordenadas, &lt;li&gt; para elementos
			dentro de la lista<br><br>
			<b>&lt;p&gt;</b>para parágrafos<br><br>
			<b>&lt;span&gt;</b>para estilos de una parte del texto<br><br>

			<!--&lt;&gt;-->
			<b>&lt;body&gt;&lt;&#47body&gt;</b><br><br>
			Indica la parte del cuerpo del contenido de un documento HTML. Es una etiqueta esencial para cualquier
			documento ya que indica donde empieza el contenido visible del documento.<br><br>

			<b>&lt;head&gt;&lt;&#47head&gt;</b><br><br>
			La parte superior del documento HTML, es donde podremos indicar los metadatos: título del documento, hojas
			de estilos, javaScript, CSS…<br><br>

			<b>&lt;div&gt;&lt;&#47div&gt;</b><br><br>
			Un elemento que es usado mayoritariamente para agrupar otros elementos y actuar como plantilla de otros
			controles. La etiqueta <b>&lt;div&gt;</b> nos ayuda a estructurar el documento en secciones.<br><br>


			<b>&lt;a&gt;&lt;&#47a&gt;</b><br><br>
			Es una etiqueta que nos ayuda a poder crear un enlace a una p&aacute;gina web. El atributo principal de la
			etiqueta HTML es href, donde pondremos el enlace al que queremos conectar. Otro atributo muy usado es
			target, el cual nos sirve para indicar si el enlace se abrir&aacute; en una nueva ventana o en la
			misma.<br><br>

			Ejemplo HTML:<br><br>

			Pulsa &lt;a href=&rdquo;https:&#47&#47www.nombredelaweb.com&#47&rdquo;
			target=&rdquo;_blank&rdquo;>aqu&iacute;</a> para visitar DonDominio.<br><br>

			<b>&lt;strong&gt;&lt;&#47strong&gt;</b><br><br>
			Si tienes mucho texto, es importante poder dar énfasis a una parte en concreto, con la etiqueta strong lo
			podemos hacer.<br><br>

			<img id="imagen3" src="/imagen3.png" alt=""><br><br>

			Ejemplo HTML:

			Quiero destacar solo &lt;strong&gt;esta palabra&lt;&#47strong&gt;.<br><br>

			<b>&lt;br&gt;</b><br><br>
			Con esta etiqueta HTML le podemos decir al navegador que viene un salto de l&iacute;nea. Nos sirve para
			hacer el texto m&aacute;s le&iacute;ble.<br><br>

			<b>&lt;H1&gt;&lt;&#47H1&gt;....&lt;H6&gt;&lt;&#47H6&gt;</b><br><br>

			Hay diferentes niveles de t&iacute;tulos, del 1 al 6. Las etiquetas nos permiten indicar la importancia del
			t&iacute;tulo y para estructurar el contenido, de esta forma ayudamos a los bots a entender la importancia
			del contenido.<br><br>

			<b>&lt;IMG&gt;&lt;&#47IMG&gt;</b><br><br>
			Usamos la etiqueta IMG para mostrar im&aacute;genes dentro del contenido. Necesita el atributo src para
			funcionar, ya que ser&aacute; donde indicaremos desde donde tiene que mostrar la imagen.<br><br>

			<b>&lt;OL&gt;&nbsp;&lt;li&gt;&lt;&#47li&gt;&nbsp;&lt;OL&gt;&nbsp;&#10072;&nbsp;&lt;UL&gt;&nbsp;&lt;li&gt;&lt;&#47li&gt;&lt;&nbsp;UL&gt</b><br><br>

			Las etiquetas OL y LI nos sirven para crear listas, OL para listas ordenadas y UL para listas sin orden.
			Dentro de las listas, los elementos se identifican con la etiqueta LI.

			Ejemplo HTML:<br><br>

			&lt;UL&gt;<br><br>

			&lt;li&gt;&lt;Primer elemento&lt;&#47li&gt;<br><br>

			&lt;li&gt;&lt;Segundo elemento&lt;&#47li&gt;<br><br>

			&lt;&#47UL&gt;<br><br>

			<b>&lt;P&gt;&nbsp;&lt;&#47P&gt;</b><br><br>

			Etiqueta que nos sirve para agrupar texto dentro de un par&aacute;grafo. El prop&oacute;sito es poder hacer
			el contenido m&aacute;s f&aacute;cil de leer y organizado.<br><br>


			<b>&lt;SPAN&gt;&nbsp;&lt;&#47SPAN&gt;</b><br><br>
			Con la etiqueta podemos personalizar el estilo de solamente una parte del texto.<br><br>

			Ejemplo HTML:<br><br>

			Solo &lt;span style=&rdquo;color: red;&rdquo;&gt;esta palabra;&lt;&#47SPAN&gt;en rojo.<br><br>

			<b>Ventajas y desventajas del HTML</b><br><br>
			Como todo lenguaje inform&aacute;tico, el HTML tiene sus ventajas y sus desventajas. Entre las ventajas,
			podr&iacute;amos destacar que es apto para principiantes, que tiene una curva de aprendizaje poco profunda y
			que es accesible. Adem&aacute;s, es de <b>c&oacute;digo abierto y completamente gratuito</b> y se ejecuta de
			forma nativa en todos los navegadores web.<br><br>

			Por otro lado, entre las desventajas, se encuentra que para una funcionalidad din&aacute;mica es posible que
			haya que utilizar JavaScript o un lenguaje back-end como PHP. Adem&aacute;s, los usuarios deben crear
			p&aacute;ginas web individuales para HTML, incluso si los elementos son los mismos y es posible que los
			navegadores m&aacute;s antiguos no muestren las etiquetas m&aacute;s nuevas.<br><br>

			&iquest;Qu&eacute; te ha parecido este art&iacute;culo sobre <b>etiquetas HTML?</b> Deja tus comentarios y
			&iexcl;comparte!<br><br>

			Los atributos HTML te permitir&aacute;n trabajar m&aacute;s r&aacute;pido y de forma m&aacute;s eficiente.
			Si quieres incorporar estas habilidades en tu perfil profesional no dudes en consultar nuestro <b
				class="parrafo1"> Executive Master en Marketing Digital, Anal&iacute;tica y UX</b> Contar&aacute;s con
			el apoyo y seguimiento de expertos en activo en cada una de estas &aacute;reas.<br><br>
		</p>
	</main>
	<footer>
		<div id="MenuPie">
			<ul>
				<li class="listaDesglosadaPie">
					<ul id="Menu1Pie">
						<li id="amarillo" class="listaMenu1Pie">
							<p>IEBS</p>
						</li>
						<li id="amarillo" class="listaMenu1Pie">
							<p> info@iebschool.com</p>
						</li>
						<li id="azul" class="listaMenu1Pie">
							<p>(+34) 919 058 055 - Madrid</p>
						</li>
						<li id="rojo" class="listaMenu1Pie">
							<p>(+34) 931 833 199 - Barcelona</p>
						</li>
						<li id="verde" class="listaMenu1Pie">
							<p>(+59) 8 2711 6748 - Montevideo</p>
						</li>
						<li id="naranja" class="listaMenu1Pie">
							<p>(+52) 55 1163 8927 - Ciudad de México</p>
						</li>
					</ul>
				</li>
				<li class="listaDesglosadaPie">
					<ul id="Menu1Pie">
						<li id="amarillo" class="listaMenu1Pie">
							<p>SOBRE NOSOTROS</p>
						</li>
						<li id="amarillo" class="listaMenu1Pie">
							<p> info@iebschool.com</p>
						</li>
						<li id="azul" class="listaMenu1Pie">
							<p>(+34) 919 058 055 - Madrid</p>
						</li>
						<li id="rojo" class="listaMenu1Pie">
							<p>(+34) 931 833 199 - Barcelona</p>
						</li>
						<li id="verde" class="listaMenu1Pie">
							<p>(+59) 8 2711 6748 - Montevideo</p>
						</li>
						<li id="naranja" class="listaMenu1Pie">
							<p>(+52) 55 1163 8927 - Ciudad de México</p>
						</li>
					</ul>
				</li>
				<li class="listaDesglosadaPie">
					<ul id="Menu1Pie">
						<li id="amarillo" class="listaMenu1Pie">
							<p>OFERTA FORMATIVA</p>
						</li>
						<li id="amarillo" class="listaMenu1Pie">
							<p> info@iebschool.com</p>
						</li>
						<li id="azul" class="listaMenu1Pie">
							<p>(+34) 919 058 055 - Madrid</p>
						</li>
						<li id="rojo" class="listaMenu1Pie">
							<p>(+34) 931 833 199 - Barcelona</p>
						</li>
						<li id="verde" class="listaMenu1Pie">
							<p>(+59) 8 2711 6748 - Montevideo</p>
						</li>
						<li id="naranja" class="listaMenu1Pie">
							<p>(+52) 55 1163 8927 - Ciudad de México</p>
						</li>
					</ul>
				</li>
				<li class="listaDesglosadaPie">
					<ul id="Menu1Pie">
						<li id="amarillo" class="listaMenu1Pie">
							<h3>¿HABLAMOS?</h3>
						</li>
						<li id="amarillo" class="listaMenu1Pie">
							<p> info@iebschool.com</p>
						</li>
						<li id="azul" class="listaMenu1Pie">
							<p>(+34) 919 058 055 - Madrid</p>
						</li>
						<li id="rojo" class="listaMenu1Pie">
							<p>(+34) 931 833 199 - Barcelona</p>
						</li>
						<li id="verde" class="listaMenu1Pie">
							<p>(+59) 8 2711 6748 - Montevideo</p>
						</li>
						<li id="naranja" class="listaMenu1Pie">
							<p>(+52) 55 1163 8927 - Ciudad de México</p>
						</li>
					</ul>
				</li>
				<ul>
		</div>
	</footer>
</body>

</html>